#include<stdio.h>
int welcome(void);

int main(void){
	welcome();
}

int welcome(void){
	puts("*****************************************");
	puts("*   Welcome to the Blocking Monster!!   *");
	puts("*---------------------------------------*");
	puts("*    以w,a,s,d控制人物的上下左右移動    *");
	puts("*---------------------------------------*");
	puts("*  請將□推到⊙擋住洞穴讓怪獸無法出來   *");
	puts("*---------------------------------------*");
	puts("*           按任意鍵開始遊戲            *");
	puts("*---------------------------------------*");
	puts("*          按「r」重新開始遊戲          *");
	puts("*****************************************");
	
	return 0;
}
